# Importing required Modules and libraries

In [245]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings('ignore')
%matplotlib inline
import seaborn as sns

# Importing Dataset

In [246]:
train = pd.read_excel(r'c:\Users\Sony\Desktop\Food-Train.xlsx')

In [247]:
test = pd.read_excel(r'c:\Users\Sony\Desktop\Food-Test.xlsx')

# Exploring Dataset

In [248]:
train.head()

,TITLE,RESTAURANT_ID,CUISINES,TIME,CITY,LOCALITY,RATING,VOTES,COST
0,CASUAL DINING,9438,"Malwani, Goan, North Indian","11am – 4pm, 7:30pm – 11:30pm (Mon-Sun)",Thane,Dombivali East,3.6,49 votes,1200
1,"CASUAL DINING,BAR",13198,"Asian, Modern Indian, Japanese",6pm – 11pm (Mon-Sun),Chennai,Ramapuram,4.2,30 votes,1500
2,CASUAL DINING,10915,"North Indian, Chinese, Biryani, Hyderabadi","11am – 3:30pm, 7pm – 11pm (Mon-Sun)",Chennai,Saligramam,3.8,221 votes,800
3,QUICK BITES,6346,"Tibetan, Chinese",11:30am – 1am (Mon-Sun),Mumbai,Bandra West,4.1,24 votes,800
4,DESSERT PARLOR,15387,Desserts,11am – 1am (Mon-Sun),Mumbai,Lower Parel,3.8,165 votes,300

In [249]:
test.head()

,TITLE,RESTAURANT_ID,CUISINES,TIME,CITY,LOCALITY,RATING,VOTES
0,CASUAL DINING,4085,"North Indian, Chinese, Mughlai, Kebab",12noon – 12midnight (Mon-Sun),Noida,Sector 18,4.3,564 votes
1,QUICK BITES,12680,"South Indian, Fast Food, Pizza, North Indian",7am – 12:30AM (Mon-Sun),Mumbai,Grant Road,4.2,61 votes
2,CASUAL DINING,1411,"North Indian, Seafood, Biryani, Chinese",11am – 11:30pm (Mon-Sun),Mumbai,Marine Lines,3.8,350 votes
3,None,204,Biryani,"9am – 10pm (Mon, Wed, Thu, Fri, Sat, Sun), 10:...",Faridabad,NIT,3.8,1445 votes
4,QUICK BITES,13453,"South Indian, Kerala",11am – 10pm (Mon-Sun),Kochi,Kaloor,3.6,23 votes

In [250]:
train["source"] = "train"
test["source"] = "test"

# Concatinating train and test dataset

In [251]:
df = pd.concat([train,test])

In [252]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 16921 entries, 0 to 4230
Data columns (total 10 columns):
CITY             16774 non-null object
COST             12690 non-null float64
CUISINES         16921 non-null object
LOCALITY         16793 non-null object
RATING           16917 non-null object
RESTAURANT_ID    16921 non-null int64
TIME             16921 non-null object
TITLE            16921 non-null object
VOTES            15315 non-null object
source           16921 non-null object
dtypes: float64(1), int64(1), object(8)
memory usage: 1.4+ MB

In [253]:
#Investigating the entire dataset first
df.duplicated().sum()

26

In [254]:
df= df.drop_duplicates()

# Missing Values Detection

In [255]:
df.isna().sum()

CITY              147
COST             4230
CUISINES            0
LOCALITY          128
RATING              4
RESTAURANT_ID       0
TIME                0
TITLE               0
VOTES            1602
source              0
dtype: int64

# Data Cleaning

In [256]:
df.drop(columns=['LOCALITY'])

,CITY,COST,CUISINES,RATING,RESTAURANT_ID,TIME,TITLE,VOTES,source
0,Thane,1200.0,"Malwani, Goan, North Indian",3.6,9438,"11am – 4pm, 7:30pm – 11:30pm (Mon-Sun)",CASUAL DINING,49 votes,train
1,Chennai,1500.0,"Asian, Modern Indian, Japanese",4.2,13198,6pm – 11pm (Mon-Sun),"CASUAL DINING,BAR",30 votes,train
2,Chennai,800.0,"North Indian, Chinese, Biryani, Hyderabadi",3.8,10915,"11am – 3:30pm, 7pm – 11pm (Mon-Sun)",CASUAL DINING,221 votes,train
3,Mumbai,800.0,"Tibetan, Chinese",4.1,6346,11:30am – 1am (Mon-Sun),QUICK BITES,24 votes,train
4,Mumbai,300.0,Desserts,3.8,15387,11am – 1am (Mon-Sun),DESSERT PARLOR,165 votes,train
...,...,...,...,...,...,...,...,...,...
4226,New Delhi,NaN,"North Indian, Mughlai, Chinese",3.9,9057,11:30am – 11:30pm (Mon-Sun),CASUAL DINING,287 votes,test
4227,Bangalore,NaN,"Biryani, North Indian, Sandwich, Salad, Wraps",4.3,1247,11am – 1am (Mon-Sun),None,469 votes,test
4228,Faridabad,NaN,"Continental, North Indian",3.7,8617,9:30am – 10:30pm (Mon-Sun),QUICK BITES,53 votes,test
4229,Kochi,NaN,"Rolls, Beverages",-,6485,"11am – 11:30pm (Mon, Tue, Wed, Thu, Sat, Sun),...",QUICK BITES,NaN,test
4230,Bandra West,NaN,Mughlai,3.7,2421,5pm – 1am (Mon-Sun),QUICK BITES,63 votes,test

In [257]:
cuisines_list=[]
for row in df['CUISINES']:
    cuisines_list.append(list(row.split(',')))

df['CUISINES']=cuisines_list

In [258]:
df_cuisines=df['CUISINES'].apply(lambda x: pd.Series(1, x))

In [259]:
title_list=[]
for row in df['TITLE']:
    title_list.append(list(row.split(',')))
df['TITLE']=title_list

In [260]:
df_title=df['TITLE'].apply(lambda x: pd.Series(1, x))

In [261]:
df_title.head()

,CASUAL DINING,BAR,QUICK BITES,DESSERT PARLOR,CAFÉ,MICROBREWERY,BEVERAGE SHOP,IRANI CAFE,BAKERY,None,...,FOOD TRUCK,MESS,KIOSK,CLUB,CONFECTIONERY,DHABA,MEAT SHOP,COCKTAIL BAR,PAAN SHOP,BHOJANALYA
0,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1.0,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [262]:
# cleaning time - pending

df[df['RATING'].isna()]

,CITY,COST,CUISINES,LOCALITY,RATING,RESTAURANT_ID,TIME,TITLE,VOTES,source
204,Kochi,200.0,[Bakery],Marine Drive,NaN,15062,Not Available,[BAKERY],NaN,train
421,Hyderabad,350.0,"[Cafe, Fast Food]",Banjara Hills,NaN,14127,Not Available,[CAFÉ],NaN,train
2035,Kochi,NaN,"[Kerala, Arabian]",Kakkanad,NaN,2776,Not Available,[QUICK BITES],NaN,test
2758,Kochi,NaN,"[Chinese, North Indian, South Indian]",Tripunithura,NaN,11301,Not Available,[None],NaN,test

In [263]:
df["RATING"] = df.RATING.transform(lambda x : x.fillna(x.mode()[0]))

In [264]:
df['RATING']=df['RATING'].str.extract('(\d+)').astype(float)

In [265]:
df['VOTES'].isna().sum()

1602

# Filling Missing Values

In [266]:
df.VOTES.fillna('0',inplace=True)
df['VOTES']=df['VOTES'].str.extract('(\d+)').astype(float)

In [267]:
df.drop(columns='CUISINES',inplace=True)

In [268]:
df.drop(columns='TITLE',inplace=True)

In [272]:
df.drop(columns='CITY',inplace=True)
df.drop(columns='LOCALITY',inplace=True)

In [273]:
df_column_category = df.select_dtypes(exclude=np.number).columns
df_column_category

Index(['TIME', 'source'], dtype='object')

In [274]:
#df.drop(columns='City found',inplace=True)
df.drop(columns='TIME',inplace=True)

In [275]:
df.fillna(0,inplace=True)

# Train-Test-Split

In [276]:
train_final = df[df.source=="train"]
test_final = df[df.source=="test"]

In [277]:
train_final.shape

(12665, 5)

In [278]:
train_final.drop(columns=["source"],inplace=True)

In [279]:
test_final.drop(columns=["source",'COST'],inplace=True)

In [280]:
train_X = train_final.drop(columns=["COST",'RESTAURANT_ID'])

In [281]:
train_Y = train_final["COST"]

In [282]:
test_X = test_final.drop(columns=["RESTAURANT_ID"])

In [283]:
train_X.fillna(0,inplace=True)
train_X.isna().sum()

RATING    0
VOTES     0
dtype: int64

# Model Development

In [284]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()
model.fit(train_X, train_Y)
dtrain_predictions = model.predict(train_X)

# Cross Validation to avoid Overfitting

In [285]:
from sklearn.model_selection import cross_val_score
a = cross_val_score(model, train_X, train_Y, cv=5, scoring='neg_mean_squared_error')

In [286]:
#Print model report:
from sklearn.metrics import mean_absolute_error,mean_squared_error,mean_squared_log_error, r2_score
print("\nModel Report")
print("RMSE : %.4g" % np.sqrt(mean_squared_error(train_Y.values, dtrain_predictions)))
    
#Predict on testing data:
test_X.fillna(0,inplace=True)
test_final["res_linear"] =  model.predict(test_X)

Model Report
RMSE : 606.2

In [287]:
print('r2 train',r2_score(train_Y,dtrain_predictions))
#print('r2 test',r2_score(test_y,test_predict))

r2 train 0.0661891245251931

In [288]:
Linear_submission = test_final[["RESTAURANT_ID","res_linear"]]

In [289]:
Linear_submission.head(20)

    RESTAURANT_ID  res_linear
0            4085  692.744101
1           12680  592.701763
2            1411  650.181357
3             204  867.967359
4           13453  585.143893
5            4518  587.729480
6            1643  580.569392
7            5109  720.389995
8            5606  675.042772
9           14319  581.762740
10           4079  613.585353
11           8873  589.718393
12          12322  683.595100
13           7910  600.458525
14            309  601.452982
15           1224  593.298437
16           6376  607.817504
17           3931  707.660950
18           2274  643.220160
19           4974  583.751654

# Saving the predicted values in csv file

In [292]:
Linear_submission=pd.DataFrame(Linear_submission,columns=['res_linear']).to_csv('Food.csv')

# Saving the best Model as a pickle in a file

In [293]:
from sklearn.externals import joblib

In [295]:
joblib.dump(model,'Food.pkl')

['Food.pkl']